# lets start with the basics of making Dataframes without read

The first part is really to start with list let's say that we have a list of employees names and salary and their ages

In [21]:
import random 
import pandas as pd

In [9]:
?random.randint

Signature: random.randint(a, b)
Docstring:
Return random integer in range [a, b], including both end points.

File:      ~/miniforge3/envs/new_ml_practice/lib/python3.11/random.py
Type:      method

In [29]:
names = ["Thomas","James","Saru","Tonde","Tarisai"]
ages, salary = [ random.randint(0,100) for i in range(len(names))], [ f"${random.randint(0,10000):.2f}" for i in range(len(names))]

In [43]:
list(zip(names,ages,salary))

[('Thomas', 33, '$6877.00'),
 ('James', 52, '$7075.00'),
 ('Saru', 87, '$5693.00'),
 ('Tonde', 73, '$7735.00'),
 ('Tarisai', 11, '$5486.00')]

In [49]:
# You need this structure for multiple columns > 2 : [('Thomas', 33, '$6877.00'),
#                                                     ('James', 52, '$7075.00'),
#                                                     ('Saru', 87, '$5693.00'),
#                                                     ('Tonde', 73, '$7735.00'),
#                                                     ('Tarisai', 11, '$5486.00')]

pd.DataFrame(zip(names,ages,salary), columns=["names","ages","salarly"])

     names  ages   salarly
0   Thomas    33  $6877.00
1    James    52  $7075.00
2     Saru    87  $5693.00
3    Tonde    73  $7735.00
4  Tarisai    11  $5486.00

In [50]:
# You don't require list(zip(**)) with pandas 
#  pd.DataFrame(zip(names,ages), columns=["naems","ages"])

#  pd.DataFrame(names,ages, columns=["naems","ages"]) # this is an error because it assume first colum to be the index 
pd.DataFrame(names,ages, columns=["ages"])

       ages
33   Thomas
52    James
87     Saru
73    Tonde
11  Tarisai